org/dev.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MinasMazar's blog ~ dev stuff</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">MinasMazar's blog ~ dev stuff</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2fa089d">Docker</a></li>
<li><a href="#org0359e7b">Installing Linux on MacBookPro</a>
<ul>
<li><a href="#org4aba7cb">Bluetooh issues</a></li>
<li><a href="#org3db4571">Sound issues</a></li>
<li><a href="#orgd5e5474">Remap keys with xmodmap</a></li>
<li><a href="#orgff0c0a9">Set keyboard layout</a></li>
<li><a href="#orgd18d75a">I3 window manager</a></li>
</ul>
</li>
<li><a href="#org1676473">Icons</a></li>
<li><a href="#org01f3553">Git</a></li>
<li><a href="#org15ba479">Pulseaudio</a></li>
<li><a href="#org417b95f">GPG</a>
<ul>
<li><a href="#orgd05ab86">Keep GnuPG credentials cached for entire user session</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2fa089d" class="outline-2">
<h2 id="org2fa089d">Docker</h2>
<div class="outline-text-2" id="text-org2fa089d">
<p>
Disable/enable autostart of a docker container.
</p>

<div class="org-src-container">
<pre class="src src-sh">docker update --restart [no|unless-stopped] &lt;docker-container&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0359e7b" class="outline-2">
<h2 id="org0359e7b">Installing Linux on MacBookPro</h2>
<div class="outline-text-2" id="text-org0359e7b">
</div>
<div id="outline-container-org4aba7cb" class="outline-3">
<h3 id="org4aba7cb">Bluetooh issues</h3>
<div class="outline-text-3" id="text-org4aba7cb">
<p>
Installed this seems to fix.
</p>
<ul class="org-ul">
<li><a href="https://github.com/leifliddy/macbook12-bluetooth-driver">https://github.com/leifliddy/macbook12-bluetooth-driver</a></li>
</ul>

<p>
Bluetooth is not still completely relyable and sometimes I have problems to pair and connect. Probably it's better to search for somethig like <i>mackbook13-bluetooth-driver</i> :D
</p>
</div>
</div>

<div id="outline-container-org3db4571" class="outline-3">
<h3 id="org3db4571">Sound issues</h3>
<div class="outline-text-3" id="text-org3db4571">
<p>
After the install I've noticed the laptop speakers weren't usable. I've googled and and found these repo that seems to fix the issue.
</p>
<ul class="org-ul">
<li><a href="https://github.com/egorenar/snd-hda-codec-cs8409">https://github.com/egorenar/snd-hda-codec-cs8409</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd5e5474" class="outline-3">
<h3 id="orgd5e5474">Remap keys with xmodmap</h3>
<div class="outline-text-3" id="text-orgd5e5474">
<p>
at .Xmodmap
</p>

<p>
!
! Swap Caps<sub>Lock</sub> and Control<sub>L</sub>
!
remove Lock = Caps<sub>Lock</sub>
remove Control = Control<sub>L</sub>
remove Lock = Control<sub>L</sub>
remove Control = Caps<sub>Lock</sub>
keysym Control<sub>L</sub> = Caps<sub>Lock</sub>
keysym Caps<sub>Lock</sub> = Control<sub>L</sub>
add Lock = Caps<sub>Lock</sub>
add Control = Control<sub>L</sub>
</p>
</div>
</div>

<div id="outline-container-orgff0c0a9" class="outline-3">
<h3 id="orgff0c0a9">Set keyboard layout</h3>
<div class="outline-text-3" id="text-orgff0c0a9">
<p>
From <a href="https://www.baeldung.com/linux/console-change-keyboard-layout">https://www.baeldung.com/linux/console-change-keyboard-layout</a>
</p>

<p>
localectl list-x11-keymap-layouts # get the list
setxkbmap us # set the keyboard
xmodmap .Xmodmap # &lt;&#x2013; REQUIRED! It seems last command has resetted the custom remaps.
</p>

<p>
To permanently configure edit the <code>/etc/default/keyboard</code> file, if present, or use <code>localectl</code>.
</p>
</div>
</div>

<div id="outline-container-orgd18d75a" class="outline-3">
<h3 id="orgd18d75a">I3 window manager</h3>
<div class="outline-text-3" id="text-orgd18d75a">
<p>
I don't want wm keybindings to interfere with Emacs, so I'll wrap all i3 keybindings into ad-hoc "i3" mode at <code>s-space</code> keybinding.
</p>

<div class="org-src-container">
<pre class="src src-text"># This file has been auto-generated by i3-config-wizard(1).
# It will not be overwritten, so edit it as you like.
#
# Should you change your keyboard layout some time, delete
# this file and re-run i3-config-wizard(1).
#

# i3 config file (v4)
#
# Please see https://i3wm.org/docs/userguide.html for a complete reference!

set $mod Mod4

# Font for window titles. Will also be used by the bar unless a different font
# is used in the bar {} block below.
font pango:monospace 8

# This font is widely installed, provides lots of unicode glyphs, right-to-left
# text rendering and scalability on retina/hidpi displays (thanks to pango).
#font pango:DejaVu Sans Mono 8

# Start XDG autostart .desktop files using dex. See also
# https://wiki.archlinux.org/index.php/XDG_Autostart
exec --no-startup-id dex --autostart --environment i3

# The combination of xss-lock, nm-applet and pactl is a popular choice, so
# they are included here as an example. Modify as you see fit.

# xss-lock grabs a logind suspend inhibit lock and will use i3lock to lock the
# screen before suspend. Use loginctl lock-session to lock your screen.
exec --no-startup-id xss-lock --transfer-sleep-lock -- i3lock --nofork

# NetworkManager is the most popular way to manage wireless networks on Linux,
# and nm-applet is a desktop environment-independent system tray GUI for it.
exec --no-startup-id nm-applet
# exec --no-startup-id "/usr/bin/python3 /usr/bin/blueman-applet"

# Define names for default workspaces for which we configure key bindings later on.
# We use variables to avoid repeating the names in multiple places.
set $ws1 "1"
set $ws2 "2"
set $ws3 "3"
set $ws4 "4"
set $ws5 "5"
set $ws6 "6"
set $ws7 "7"
set $ws8 "8"
set $ws9 "9"
set $ws10 "10"

# Use pactl to adjust volume in PulseAudio.
set $refresh_i3status killall -SIGUSR1 i3status
bindsym XF86AudioRaiseVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ +10% &amp;&amp; $refresh_i3status
bindsym XF86AudioLowerVolume exec --no-startup-id pactl set-sink-volume @DEFAULT_SINK@ -10% &amp;&amp; $refresh_i3status
bindsym XF86AudioMute exec --no-startup-id pactl set-sink-mute @DEFAULT_SINK@ toggle &amp;&amp; $refresh_i3status
bindsym XF86AudioMicMute exec --no-startup-id pactl set-source-mute @DEFAULT_SOURCE@ toggle &amp;&amp; $refresh_i3status

# Use Mouse+$mod to drag floating windows to their wanted position
# floating_modifier $mod

# kill focused window
bindsym $mod+Shift+q kill
bindsym $mod+Tab focus next

mode "i3" {
  bindsym r mode "resize"
  bindsym $mod+space mode "default"

  # start dmenu (a program launcher)
  bindsym d exec --no-startup-id dmenu_run
  # A more modern dmenu replacement is rofi:
  # bindcode 40 exec "rofi -modi drun,run -show drun"
  # There also is i3-dmenu-desktop which only displays applications shipping a
  # .desktop file. It is a wrapper around dmenu, so you need that installed.
  # bindcode 40 exec --no-startup-id i3-dmenu-desktop
  # enter fullscreen mode for the focused container
  bindsym f fullscreen toggle
  # reload the configuration file
  bindsym Shift+c reload
  # restart i3 inplace (preserves your layout/session, can be used to upgrade i3)
  bindsym Shift+r restart
  # exit i3 (logs you out of your X session)
  bindsym Shift+e exec "i3-nagbar -t warning -m 'You pressed the exit shortcut. Do you really want to exit i3? This will end your X session.' -B 'Yes, exit i3' 'i3-msg exit'"

  # change focus
  bindsym j focus left
  bindsym k focus down
  bindsym l focus up
  bindsym ograve focus right

  # alternatively, you can use the cursor keys:
  bindsym Left focus left
  bindsym Down focus down
  bindsym Up focus up
  bindsym Right focus right

  # move focused window
  bindsym Shift+j move left
  bindsym Shift+k move down
  bindsym Shift+l move up
  bindsym Shift+ograve move right

  # alternatively, you can use the cursor keys:
  bindsym Shift+Left move left
  bindsym Shift+Down move down
  bindsym Shift+Up move up
  bindsym Shift+Right move right

  # split in horizontal orientation
  bindsym h split h

  # split in vertical orientation
  bindsym v split v

  # change container layout (stacked, tabbed, toggle split)
  bindsym s layout stacking
  bindsym w layout tabbed
  bindsym e layout toggle split

  # toggle tiling / floating
  bindsym Shift+space floating toggle

  # change focus between tiling / floating windows
  bindsym space focus mode_toggle

  # focus the parent container
  bindsym a focus parent

  # focus the child container
  #bindsym d focus child

  # switch to workspace
  bindsym 1 workspace number $ws1
  bindsym 2 workspace number $ws2
  bindsym 3 workspace number $ws3
  bindsym 4 workspace number $ws4
  bindsym 5 workspace number $ws5
  bindsym 6 workspace number $ws6
  bindsym 7 workspace number $ws7
  bindsym 8 workspace number $ws8
  bindsym 9 workspace number $ws9
  bindsym 0 workspace number $ws10

  # move focused container to workspace
  bindsym Shift+1 move container to workspace number $ws1
  bindsym Shift+2 move container to workspace number $ws2
  bindsym Shift+3 move container to workspace number $ws3
  bindsym Shift+4 move container to workspace number $ws4
  bindsym Shift+5 move container to workspace number $ws5
  bindsym Shift+6 move container to workspace number $ws6
  bindsym Shift+7 move container to workspace number $ws7
  bindsym Shift+8 move container to workspace number $ws8
  bindsym Shift+9 move container to workspace number $ws9
  bindsym Shift+0 move container to workspace number $ws10
}

# resize window (you can also use the mouse for that)
mode "resize" {
  # These bindings trigger as soon as you enter the resize mode

  # Pressing left will shrink the window&#8217;s width.
  # Pressing right will grow the window&#8217;s width.
  # Pressing up will shrink the window&#8217;s height.
  # Pressing down will grow the window&#8217;s height.
  bindsym j resize shrink width 10 px or 10 ppt
  bindsym k resize grow height 10 px or 10 ppt
  bindsym l resize shrink height 10 px or 10 ppt
  bindsym ograve resize grow width 10 px or 10 ppt

  # same bindings, but for the arrow keys
  bindsym Left resize shrink width 10 px or 10 ppt
  bindsym Down resize grow height 10 px or 10 ppt
  bindsym Up resize shrink height 10 px or 10 ppt
  bindsym Right resize grow width 10 px or 10 ppt

  # back to normal: Enter or Escape or $mod+r
  bindsym Return mode "default"
  bindsym Escape mode "default"
  bindsym $mod+r mode "default"
}

bindsym $mod+space mode "i3"

# Start i3bar to display a workspace bar (plus the system information i3status
# finds out, if available)
bar {
  mode hide

  status_command i3status
}

exec --no-startup-id emacs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1676473" class="outline-2">
<h2 id="org1676473">Icons</h2>
<div class="outline-text-2" id="text-org1676473">
<ul class="org-ul">
<li><a href="https://remixicon.com/">https://remixicon.com/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org01f3553" class="outline-2">
<h2 id="org01f3553">Git</h2>
<div class="outline-text-2" id="text-org01f3553">
<p>
How do I change the author and committer name/email for multiple commits?
</p>

<div class="org-src-container">
<pre class="src src-sh">git rebase -r a5bf6c2 --exec <span style="color: #af9fff;">'git commit --amend --no-edit --reset-author'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org15ba479" class="outline-2">
<h2 id="org15ba479">Pulseaudio</h2>
<div class="outline-text-2" id="text-org15ba479">
<p>
You can refer this interesting <a href="https://askubuntu.com/questions/71863/how-to-change-pulseaudio-sink-with-pacmd-set-default-sink-during-playback">SO thread</a>.
</p>

<div class="org-src-container">
<pre class="src src-sh">pacmd help list-sinks
pacmd list-sink-inputs
pacmd move-sink-input 5 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org417b95f" class="outline-2">
<h2 id="org417b95f">GPG</h2>
<div class="outline-text-2" id="text-org417b95f">
</div>
<div id="outline-container-orgd05ab86" class="outline-3">
<h3 id="orgd05ab86">Keep GnuPG credentials cached for entire user session</h3>
<div class="outline-text-3" id="text-orgd05ab86">
<p>
For GnuPG 2.1 and below edit user configuration file at <code>~/.gnupg/gpg-agent.conf</code>. In the example below the TTL is set to 3h.
</p>

<div class="org-src-container">
<pre class="src src-sh">default-cache-ttl 10800
max-cache-ttl 10800
</pre>
</div>

<p>
Then restart the agent
</p>

<div class="org-src-container">
<pre class="src src-sh">gpgconf --kill gpg-agent
gpg-agent --daemon --use-standard-socket
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-31 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
